NCE2/L80 The Crystal Palace.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>

*  Lesson 80 The Crystal Palace
#+begin_verse
How many people visited the Great Exhibition of 1851?

Perhaps the most extraordinary building of the nineteenth century was the Crystal Palace,
	which was built in Hyde Park for the Great Exhibition of 1851.
The Crystal Palace was different from all other buildings in the world,
	for it *was made of* iron and glass.
It was one of the biggest buildings *of all time*
	and a lot of people from many countries came to see it.
A great many goods were sent to the exhibition from various parts of the world.
There was also a great deal of machinery *on display*.
The most wonderful piece of machinery on show was Nasmyth's steam hammer.
Though in those days, traveling was not as easy as it is today,
	steam boats carried thousands of visitors across the Channel from Europe.
On arriving in England, they were taken to the Crystal Palace by train.
There were six million visitors *in all*,
	and the profits from the exhibition were used to build museums and colleges.
Later, the Crystal Palace was moved to South London.
It remained one of the most famous buildings in the world until it was burnt down in 1936.

#+end_verse
** expression
palace [ˈpæləs] n.宫殿
extraordinary [ɪkˈstrɔrd(ə)nˌeri] adj.不平常的,非凡的
exhibition [ˌeksɪˈbɪʃ(ə)n] n.展览
iron [ˈaɪrn] n.铁
various [ˈveriəs] adj.各种各样的
machinery [məˈʃinəri] n.机器
display [dɪˈspleɪ] n.展览
steam [stim] n.蒸汽
profit [ˈprɑfɪt] n.利润
college [ˈkɑlɪdʒ] n.学院

on show/on display 展览
make a profit 赚取利润
go to college 上大学
--------------------
be made of 由……制成
of all time 有史以来的
in all 总共


** words
palace [ˈpæləs] n.宫殿
extraordinary [ɪkˈstrɔrd(ə)nˌeri] adj.不平常的,非凡的
exhibition [ˌeksɪˈbɪʃ(ə)n] n.展览
iron [ˈaɪrn] n.铁
various [ˈveriəs] adj.各种各样的
machinery [məˈʃinəri] n.机器
display [dɪˈspleɪ] n.蒸汽
profit [ˈprɑfɪt] n.利润
college [ˈkɑlɪdʒ] n.学院

** DONE 单词造句
CLOSED: [2023-09-18 Mon 21:40]
palace n.
- They have been visiting the palace for a week.
- Instead of the king, the palace takes its name from its builder.
- They were afraid that the palace would be burnt down by the people.
- 'Get out of here.' A security guard in front of the palace said.
- The farmer carried ten tons of corn stalks to the palace.
extraordinary adj.
- What an extraordinary women she is.
- They have been expecting an extraordinary crop this year.
- Leo pointed out that it was an extraordinary idea.
- It must be the only extraordinary house in the village.
- During this time, they will give five extraordinary performances.
exhibition n.
- On arriving the exhibition, my wife begun to take a great many photographs.
- My wife has not only enjoyed the exhibition, but the garden as well.
- She is losing her temper in the exhibition.
- She sometimes goes to the exhibition on Weekends.
- She went to the exhibition last week.
iron n.
- They have successfully turned gold into iron.
- Rachel, whose aunt turned gold into iron, is crying.
- The factory has been turning gold into iron.
- He managed to escape with an abandoned iron bar.
- He used to wander with an abandoned iron bar around there.
various adj.
- I'm going to read various books in office hours.
- We all were put to shame by him who had read various books in his spare time.
- It occured to me that he knew various actors in the society.
- The player has met various actors in the wedding.
- After having read various books about technology, she turned her attention to education.
machinery n.
- There is an expensive piece of machinery.
- Is there any piece of machinery?
- The working machinery is made of iron and glasses.
- He would take charge of the machinery.
- He was talking to the manager of a local factory where the machinery was made.
display n. on show/on display
- Machinery like this should be on display at 8 o'clock.
- The assistant who cleaned the window did not like the way the clothes were on display.
- The machinery had been on display before the museum was closed.
- It is said that various luxuries would be on display in the exhibition.
- He saw an expensive piece of machinery be on display in the exhibition.
steam n.
- Steam engine broke down so much that it can't be repaired.
- As soon as the water boils, it turned into steam.
- It is no use pretending that you had invented the steam engine.
- He repaired the steam engine with satisfaction.
- My wife urged me to have the steam engine repaired.
profit n. make a profit
- The moment the company makes a profit, he will get a good salary.
- The moment you finish the work, I will offer you a great deal of money.
- Our company will be making a profit next year.
- Our company will have made a profit by the day of this year.
- Our company will have been making a profit during the next year.
college n. go to college
- Why don't you go to college?
- She said that she wouldn't go to college.
- She had hardly gone to college when her brother was born.
- She had no sooner gone to college than her brother was born.
- If she had gone to college, she would have been more successful.
** DONE 反复听电影片段
CLOSED: [2023-09-19 Tue 21:54]
** DONE Pattern Drill 写+读
CLOSED: [2023-09-19 Tue 21:59]
-
		1t: sweet oranges - Spanish
		s1: These oranges aren't sweet enough.
		s2: Get some Spanish oranges. They'd be much sweeter.
	 - hard brushes - nylon
		 These brushes aren't hard enough.
		 Get some nylon brushes. They'd be much harder.
	 - strong bags - leather
		 These bags aren't strong enough.
		 Get some leather bags. They'd be much stronger.
	 - warm socks - woollen
		 These socks aren't warm enough.
		 Get some woollen socks. They'd be much warmer.
	 - cheap toys - plastic
		 These toys aren't cheap enough.
		 Get some plastic toys. They'd be much cheaper.
-
		2t: dirt on the floor
		s1: Was there much dirt on the floor?
		s2: No, it wasn't any dirtier than usual.
	 - noise in  the classroom
		 Was there much noise in the classroom.
		 No, it wasn't any noiser than usual.
	 - mist on  the hills
		 Was there much mist on the hills?
		 No, it wasn't any mistier than usual.
	 - wind on  the island
		 Was there much wind on the island?
		 No, it wasn't any windier than usual.
	 - clouds in  the sky
		 Was there much clouds in the sky?
		 No, it wasn't any cloudier in the sky.
-
		3t: attractive
		s1: She's the most attractive person I've ever met.
		s2: She's not as attractive as you are!
	 - interesting
		 She's the most interesting person I've ever met.
		 She's not as interesting as you are!
	 - delightful
		 She's the most delightful person I've ever met.
		 She's not as delightful as you are!
	 - hard-working
		 She's the most hard-working person I've ever met.
		 She's not as hard-working as you are!
	 - understanding
		 She's the most understanding person I've ever met.
		 She's not as understanding as you are!
-
		4t: drive - quickly
		s1: He drove as quickly as he could.
		s2: Yes, he couldn't have driven any more quickly.
	 - stay - long
		 He stayed as long as he could.
		 Yes, he couldn't have stayed any longer.
	 - walk - far
		 He walked as far as he could.
		 Yes, he couldn't have walked any farther.
	 - write - fast
		 He wrote as fast as he could.
		 Yes, he couldn't have written any faster.
	 - fight - hard
		 He fought as hard as he could.
		 Yes, he couldn't have fought any harder.
** DONE 给自己讲解
CLOSED: [2023-09-19 Tue 22:01]
** 红皮书
** DONE 习惯用法造句
CLOSED: [2023-09-18 Mon 21:40]
be made of
- The editor asked the journalist to figure out what the palace is made of.
- The palace should have been made of iron and wood.
- The palace may only be made of iron and glasses.
- The machinery may have been made of iron and wood.
- It's the bridge which is made of iron, not wood.
of all time
- I might have fallen into love with her of all time.
- He can't be the best player in the world of all time.
- He remains the best player in the world of all time.
- He was able to swim of all time.
- He was regarded as one of the greatest poet of all time.
in all
- There are two cups of milk tea in all.
- It's said that there were 6,000 car parked in the street in all.
- There might be 300 people in the middle of the exhibition in all.
- It is said that there were 300 guards in front of the palace.
- How many people stood here in all?
** DONE 跟读至背诵
CLOSED: [2023-09-19 Tue 22:01]
** DONE Ask me if 写+读
CLOSED: [2023-09-19 Tue 21:50]
1. The Crystal Palace was built in the nineteenth century. When/What
	 When was the Crystal Palace built?
	 What was built in the nineteenth century?
2. It was built in Hyde Park. Where
		Where was it built?
3. It was built for the Great Exhibition of 185- Why/What
		Why was it built?
		What was built for the Great Exhibition of 1851?
4. It was different from all other buildings in the world. What/How
		What was it different from?
		How was it different from all other buildings in the world?
5. It was made of iron and glass. What
		What was it made of?
6. A lot of people came to see it. How many
	 How many people came to see it?
7. They came from many countries. Where
	 Where did they come from?
8. A great many goods were sent to the exhibition. How many
	 How many goods were sent to the exhibition?
9. They came from various parts of the world. Where
	 Where did they come from?
** DONE 摘要写作
CLOSED: [2023-09-19 Tue 22:17]
The Crystal Palace, which was built for the Great Exhibition of 1851,
	was different from all others in the world
	because it was made of iron and glass.
Goods from various parts of the world were on display as well as a great deal of machinery.
So many visitors came by boat and train
	that it was possible to build colleges and museums from the profits.
After the exhibition, the Crystal Palace was moved to South London,
	where it remained util it was burnt down in 1936.

The Crystal Palace was built for the Great Exhibition of 1851.
Made of iron and glass, it was different from all other buildings.
There were not only goods from various parts of the world on display
	but there was a great deal of machinery as well.
This attracted many visitors who travelled by boat and train.
Later, the colleges and museums were built from the profits.
The Crystal Palace was moved to South London and it remained util 1936, when it was burnt down.

** DONE tell the story 口语
CLOSED: [2023-09-19 Tue 22:19]
** Topics for discussion
